Tekla Open API Reference for Tekla Structures 2025
SectionMarkAttributes Properties
The SectionMarkBase.SectionMarkAttributes type exposes the following members.
Properties
Name | Description
LeftSymbol
 The symbol to use on the left side of the section mark.
LineColor
 The color of the section mark line (see DrawingColors for options).
LineLength
 The length of the section mark lines.
LineLengthOffset
 The offset from the end of the line on both sides of the section mark.
LineWidth
 The width of the section mark lines.
LineWidthOffsetLeft
 The offset from the start of the line on the left side of the section mark.
LineWidthOffsetRight
 The offset from the start of the line on the right side of the section mark.
MarkName
 The section mark name.
RightSymbol
 The symbol to use on the right side of the section mark.
SymbolColor
 The color of the mark symbols (see DrawingColors for options).
TagsAttributes
 The tags A1-A5 in the section mark attributes.
TrueLineColor
 The true color (rgb enabled) of the line.
TrueSymbolColor
 The true color (rgb enabled) of the symbol.
Top
See Also
Reference
SectionMarkBase.SectionMarkAttributes Class
Tekla.Structures.Drawing Namespace